{
  "blogs": [
    {
      "id": "1",
      "title": "Advanced Quantitative Momentum Strategies in Modern Markets",
      "description": "Exploring the evolution of momentum strategies and their application in today's volatile market conditions using machine learning techniques.",
      "author": "John Paul Paredes",
      "author_tittle": "Lead Engineer, Co-founder",
      "date": "2024-01-15",
      "readTime": "8 min read",
      "tags": ["momentum", "machine-learning", "quantitative-analysis"],
      "featured": false,
      "content": {
        "header_1": "Introduction to Modern Momentum Strategies",
        "paragraph_1": {
          "text": "Momentum strategies have been a cornerstone of quantitative finance for decades. However, the ",
          "bold": "traditional approaches",
          "text_2": " are evolving rapidly with the integration of ",
          "underlined": "machine learning algorithms",
          "text_3": " and alternative data sources. This research explores how modern momentum strategies can be enhanced through advanced statistical techniques."
        },
        "header_2": "Methodology and Data Sources",
        "paragraph_2": {
          "text": "Our analysis utilizes a comprehensive dataset spanning ",
          "bold": "15 years of market data",
          "text_2": " across multiple asset classes. The methodology incorporates ",
          "underlined": "ensemble learning techniques",
          "text_3": " to identify momentum signals with higher precision than traditional methods."
        },
        "header_3": "Key Findings and Results",
        "paragraph_3": {
          "text": "The enhanced momentum strategy demonstrated a ",
          "bold": "23% improvement in Sharpe ratio",
          "text_2": " compared to traditional momentum approaches. Most notably, the strategy showed ",
          "underlined": "reduced drawdowns during market stress periods",
          "text_3": ", making it more suitable for institutional implementation."
        },
        "header_4": "Implementation Considerations",
        "paragraph_4": {
          "text": "When implementing these strategies, practitioners should consider ",
          "bold": "transaction costs, market impact, and capacity constraints",
          "text_2": ". Our backtesting framework accounts for these real-world factors to provide ",
          "underlined": "more realistic performance expectations",
          "text_3": "."
        }
      },
      "like_count": 0
    },
    {
      "id": "2",
      "title": "Building Aletheia: The Journey Behind Our Quant Research Platform",
      "description": "A deep dive into the design and engineering process behind Aletheia, the collaborative platform for quantitative finance researchers.",
      "author": "John Paul Paredes",
      "author_tittle": "Lead Engineer, Co-founder",
      "date": "2025-07-08",
      "readTime": "7 min read",
      "tags": ["startup", "development", "quant-platform", "astro", "javascript"],
      "featured": true,
      "content": {
        "header_1": "Why We Built Aletheia",
        "paragraph_1": {
          "text": "The idea for Aletheia came from our frustration with the lack of platforms where ",
          "bold": "quant researchers",
          "text_2": " could not only share their work but also collaborate, iterate, and gain insights from the community. We envisioned a tool that empowers users to maintain blogs, track research versions, and integrate ",
          "underlined": "real-time trading metrics",
          "text_3": " and AI summarization tools."
        },
        "header_2": "Designing the MVP",
        "paragraph_2": {
          "text": "We chose a lean development approach, starting with a minimal viable product focused on the core pain point: making ",
          "bold": "quant research shareable and insightful",
          "text_2": ". Built with ",
          "underlined": "Astro, Tailwind, and Google Apps Script",
          "text_3": ", the frontend features an elegant UI and smooth UX that reflects the analytical precision we aim to deliver."
        },
        "header_3": "Overcoming Technical Challenges",
        "paragraph_3": {
          "text": "One of the biggest challenges was integrating a dynamic contact and newsletter system into a static site architecture. Using ",
          "bold": "Google Apps Script as a backend",
          "text_2": ", we created an efficient pipeline to process contact forms and marketing signups with full error handling and success feedback. We also built the form UX to support ",
          "underlined": "real-time loading states and inline messaging",
          "text_3": " for a smooth user experience."
        },
        "header_4": "What Comes Next",
        "paragraph_4": {
          "text": "The next phase includes support for ",
          "bold": "research uploads, AI-powered summaries, and version-controlled research posts",
          "text_2": ". We're also planning deeper integrations with Notion, custom metric dashboards, and ",
          "underlined": "real-time collaborative blogging",
          "text_3": ". Our goal is to make Aletheia the home for every quant mind seeking to share and build breakthrough ideas."
        }
      },
      "like_count": 0
    },
    {
      "id": "3",
      "title": "Meet the Team Behind Aletheia",
      "description": "Introducing the passionate individuals who are building the future of collaborative quant research.",
      "author": "John Paul Paredes",
      "author_tittle": "Lead Engineer, Co-founder",
      "date": "2025-07-08",
      "readTime": "5 min read",
      "tags": ["team", "startup", "about-us", "founders", "aletheia"],
      "featured": true,
      "content": {
        "header_1": "Our Founding Vision",
        "paragraph_1": {
          "text": "Aletheia started as a dream shared between friends who believed that ",
          "bold": "finance and technology",
          "text_2": " could be democratized through the right tools and collaboration. We’ve come together from different strengths to build something we believe will shape the future of ",
          "underlined": "quantitative research",
          "text_3": "."
        },
        "header_2": "John Paul Paredes – Engineer, Quant & Visionary",
        "paragraph_2": {
          "text": "I’m John Paul, a developer, quant researcher, and finance enthusiast. From a young age I’ve been driven by a need to understand how things work and how to make them better. With a strong passion for ",
          "bold": "problem solving, markets, and AI",
          "text_2": ", I’ve dedicated myself to building tools that empower other researchers like me. Aletheia is my way of giving back to a field that continuously challenges and inspires me.",
          "underlined": "",
          "text_3": ""
        },
        "header_3": "Luciano Zeballos – The Brainstormer with a Heart",
        "paragraph_3": {
          "text": "Luciano is more than just a co-founder — he’s been my best friend since childhood. A mind that never stops creating, he brings ",
          "bold": "world-class communication and visionary ideas",
          "text_2": " to the table. From naming key features to architecting big-picture strategy, Luciano keeps our project grounded in human connection and ",
          "underlined": "clear communication with our users",
          "text_3": "."
        },
        "header_4": "Our Designer – Visual Brilliance in Every Pixel",
        "paragraph_4": {
          "text": "Every visual element in Aletheia carries meaning, thanks to our ",
          "bold": "incredibly talented graphic designer",
          "text_2": ". With a deep understanding of branding and minimalistic UX, their contribution turns ideas into visuals that resonate with our community. Their work is what ",
          "underlined": "transforms our code into a story",
          "text_3": "."
        }
      },
      "like_count": 0
    },
    {
      "id": "4",
      "title": "The Art of Storytelling",
      "description": "How visual storytelling, typography, and color theory shape the soul of a fintech platform rooted in culture.",
      "author": "Luciano Zeballos",
      "author_tittle": "Lead Product Manager, Co-founder",
      "date": "2025-07-07",
      "readTime": "7 min read",
      "tags": ["visual-design", "typography", "colour", "storytelling"],
      "featured": true,
      "content": {
        "header_1": "When Data Meets Drawing",
        "paragraph_1": {
          "text": "Behind every line of code lives a creative choice. The identity of our platform, Aletheia, doesn't start with charts or metrics—it starts with ",
          "bold": "a cartoon character with a big head and a long neck",
          "text_2": " that invites users into a journey. Like the cover of a storybook, it sets the emotional tone for the trading experience, reminding us that finance isn’t sterile—it’s personal, cultural, and expressive."
        },
        "header_2": "Designing with Cultural Intent",
        "paragraph_2": {
          "text": "Our interface is a product of deliberate design—each color, shape, and word was influenced by the principles from ",
          "bold": "Thinking Visually, Colour Workshop, and Thinking with Type",
          "text_2": ". Rather than adopting generic fintech templates, we chose soft beiges, bright turquoise, and warm corals to reflect not just usability—but ",
          "underlined": "belonging and human connection",
          "text_3": "."
        },
        "header_3": "The Typography of Trust",
        "paragraph_3": {
          "text": "Inspired by Ellen Lupton’s work, we selected typography that feels accessible and supportive. The curves of Quicksand speak softly, never shouting at the reader. It’s a nod to the idea that ",
          "bold": "trading should feel guided, not gamified",
          "text_2": ", as we lean toward slower, more thoughtful design."
        },
        "header_4": "A Framework Rooted in Story",
        "paragraph_4": {
          "text": "This platform is a ritual—a first step, a cartoon-guided onboarding, a personal dashboard that grows with you. In a world rushing for precision, we pause for ",
          "bold": "clarity with character",
          "text_2": ". Because every user deserves a system that feels made not just by engineers, but by storytellers too."
        }
      },
      "like_count": 0
    }
  ]
}
